
<HTML>
<HEAD>
<TITLE>The Hint Library (deutsch)</TITLE></HEAD>
<BODY BGCOLOR="#FFFFFF"><IMG SRC="deut.gif">
<H2>The Hint Library (Deutsch)</H2>
<P><BR>Hier k&ouml;nnen Sie direkt zu den
<A HREF="http://members.aol.com/thlhome/files_d.htm">Dateien</A> gehen.</P>
<HR>
<H3>Was ist THE HINT LIBRARY ?</H3>
<P><BR></P>
<BLOCKQUOTE>
<P>The Hint Library ist ein Programm, mit dem man Hinweis-Sammlungen erstellen
und verarbeiten kann. Urspr&uuml;nglich war das Ziel, eine elektronische Version
der INFOCOM InvisiClues(tm) zu erstellen. Dies waren kleine B&uuml;cher zu den
ber&uuml;hmten Textadventures von Infocom (z.B. The Hitchiker&#180;s Guide to
the galaxy). Darin waren zu verschiedenen Problemstellen im Spiel, thematisch
sortiert, verschl&uuml;sselte Hinweise gesammelt, die den Spieler langsam an die
L&ouml;sung eines Problems hinangef&uuml;hrt haben. Mit dem Gang in das
Multimedia-Zeitalter endete ein  St&uuml;ck Computergeschichte 1990 mit dem
Niedergang INFOCOM. Trotzdem haben die Infocom-Adventures auch heute noch eine
riesige Fangemeinde, wohl auch weil eigentlich nie wieder &quot;Geschichten zum
Mitspielen&quot; gemacht worden sind, die das Niveau dieser Kleinode erreichen
konnten. Mit dem Untergang der Firma verschwanden auch schnell die Spiele und
Hinweisb&uuml;cher vom Markt. Um zu verhindern, da&szlig; die Inhalte aus den
InvisiClues f&uuml;r immer verloren gehen, sind sie an verschiedenen Stellen im
Internet f&uuml;r nichtkommerzielle ver&ouml;ffentlicht worden, allerdings
i.d.R. als Textdateien. Um wieder InvisiClues im urspr&uuml;nglichen Sinne zu
bekommen, d.h. die Hinweise sind nicht direkt lesbar, ich entscheide selber,
wieviel Hilfe ich haben m&ouml;chte, wurde dieses Programm entwickelt. Bei der
Entwicklung ist dann immer mehr der Gedanke an ein offenes System in den
Vordergrund ger&uuml;ckt, das erweitert werden kann ( auch andere gro&szlig;e
Firmen, z.B. Magnetic Scrolls, die es inzwischen nicht mehr gibt, sollen so
verewigt werden ). Dazu wurde ein Dateiformat entwickelt, mit dem man Texte,
Bilder und Multimediadateien zusammenfassen kann. Das Programm besteht aus einem
&quot;Lese&quot;- und einem &quot;Autoren&quot;-Teil, mit dem neue Sammlungen
erstellt werden k&ouml;nnen.</P>
<P><BR>Das gro&szlig;e Ziel ist es, eine Bibliothek von Hinweissammlungen
aufzubauen, die jeder Interessierte benutzen kann. Und nat&uuml;rlich sei
hiermit jeder, dem dieses Programmgef&auml;llt und der vielleicht n&uuml;tzliche
Hinweise f&uuml;r andere Spieler hat, aufgefordert, an diesem Projekt
mitzuarbeiten.</P>
<P><BR>Ich w&uuml;nsche VIEL SPA&szlig; MIT THE HINT LIBRARY !</P></BLOCKQUOTE>
<HR>
<P ALIGN="CENTER"><FONT COLOR="#FF0000">Contact: </FONT><BR><A
HREF="mailto:SMeier7777@aol.com">SMeier7777@aol.com</A><BR><A
HREF="mailto:Stefan.Meier@post.rwth-aachen.de">Stefan.Meier@post.rwth-aachen.de</A></P>
<P><BR><EM>Letzte &Auml;nderung: 22.11.1996</EM></P></BODY></HTML>
